[
    {
        "cluster_id": 0,
        "documents": [
            "Aggies win football game in thrilling overtime!",
            "The Aggies football team is training hard for the next big game.",
            "Coach praises the defense for their strong performance.",
            "Aggies fans are hopeful for the championship this year.",
            "Football game against rivals ends in a dramatic tie.",
            "The crowd erupted as the Aggies scored the game-winning touchdown.",
            "Defensive strategy played a crucial role in last night’s game.",
            "Aggie football players dedicated the win to their loyal fans.",
            "Team morale is high as they prepare for the season's biggest match.",
            "Football analysts are impressed with the Aggies’ performance.",
            "Aggies football merchandise sold out after the big win!",
            "Massive turnout for the TAMU career fair.",
            "Companies at the career fair are actively recruiting Aggies.",
            "The job fair was packed with companies and students.",
            "Students dressed in their best suits for networking.",
            "Career fair workshops are helping students prepare.",
            "Exciting internship opportunities announced at the fair.",
            "The career fair was a great opportunity to meet employers.",
            "Aggies land interviews after networking at the career fair.",
            "Companies like Amazon and Google attended the career fair.",
            "New graduates are hopeful for positions offered at the fair.",
            "Tech companies showcased their latest innovations at the fair.",
            "Students received job offers on the spot from several companies.",
            "Engineering majors were in high demand at the career fair.",
            "The career center organized mock interviews for attendees.",
            "Networking events followed the main career fair activities.",
            "Business cards were exchanged rapidly as connections were made.",
            "Workshops focused on how to negotiate job offers effectively.",
            "New research breakthroughs at Texas A&M.",
            "The research lab is making advancements in AI.",
            "Texas A&M researchers publish a groundbreaking study.",
            "Graduate students are presenting their research findings.",
            "A research team discovers new ways to treat rare diseases.",
            "Breakthroughs in genetics research are making headlines.",
            "Physics students experiment with groundbreaking theories.",
            "Biology lab discovers a new species of bacteria in the wild.",
            "Research in renewable energy is reducing carbon footprints.",
            "Aggies lose a close basketball match.",
            "Texas A&M basketball team wins the championship!",
            "The coach strategizes for the upcoming basketball season.",
            "Basketball fans fill the arena for an intense game.",
            "Star player scores a career-high in the basketball match.",
            "Aggies basketball team prepares for March Madness.",
            "The team's defense played exceptionally well in the game.",
            "Fans cheer as the Aggies dominate on the basketball court.",
            "Preseason basketball training camp starts next week.",
            "The team is focusing on building a strong offense this year.",
            "Basketball practice intensifies as the season opener nears.",
            "The coach emphasizes teamwork and discipline at practice.",
            "The rivalry game is highly anticipated by fans and players."
        ]
    },
    {
        "cluster_id": 1,
        "documents": [
            "Fans stormed the field after the incredible victory!",
            "A buzzer-beater shot leads the Aggies to victory!"
        ]
    },
    {
        "cluster_id": 2,
        "documents": [
            "Exciting game day with tailgates and Aggie pride!",
            "Earn cash easily from home with no effort.",
            "Earn $1000 a day with this foolproof method!",
            "Work from home and earn big bucks without any skills!"
        ]
    },
    {
        "cluster_id": 3,
        "documents": [
            "Aggies are reviewing game footage to improve tactics.",
            "Players are reviewing game footage to improve techniques."
        ]
    },
    {
        "cluster_id": 4,
        "documents": [
            "Win a free iPhone by clicking this link!",
            "Free vacation to the Bahamas, just pay a small fee!",
            "Get a free gift just by signing up for our service.",
            "Get your credit score checked for free—no strings attached!"
        ]
    },
    {
        "cluster_id": 5,
        "documents": [
            "Congratulations, you've won a $500 gift card!",
            "You won't believe this shocking health discovery!"
        ]
    },
    {
        "cluster_id": 6,
        "documents": [
            "Download this app to make money fast!",
            "Invest in cryptocurrency and watch your money grow!",
            "Join our online community to make easy money!",
            "Your computer is at risk! Download this antivirus software.",
            "Act now to secure your spot in this money-making webinar!",
            "Lose weight fast with this one simple trick!"
        ]
    }
]